---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.Reset
source: html/ae0a010f-d536-0cde-a665-8c90c735b039.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```